package com.lihd;

/**
 * 1.Java类及类的成员：属性、方法、构造器；代码块、内部类
 *
 * 2.面向对象的大特征：封装性、继承性、多态性、(抽象性)
 *
 * 3.其它关键字：this、super、static、final、abstract、interface、package、import等
 *
 * “大处着眼，小处着手”
 * 1.面向过程：强调的是功能行为，以函数为最小单位，考虑怎么做。
 * 2.面向对象：强调具备了功能的对象，以类/对象为最小单位，考虑谁来做。
 *
 * 举例对比：人把大象装进冰箱。
 *
 * 类：对一类事物的描述，是抽象的、概念上的定义
 * 对象：是实际存在的该类事物的每个个体，因而也称为实例(instance)
 *   >面向对象程序设计的重点是类的设计
 *   >设计类，就是设计类的成员。
 *
 *
 *
 * @author ：葬花吟留别1851053336@qq.com
 * @description：TODO
 * @date ：2021/11/9 9:49
 */
public class OOPTest {
}
